{
  "title": "How to Manage a Remote Team During a Pandemic",
  "preview": "A good leader is a shock absorber that cushions the blows of change.",
  "slug": "how-to-manage-a-remote-team-during-a-pandemic",
  "tags": [
    "management",
    "remote"
  ],
  "bodyContent": "![wide: View from Hope Outdoor Gallery in Austin, TX. &copy; 2020 John Apostol](hero.jpg)\n\n# Personal Context\n\nI had planned for 2020 to be the most important year in my career. This was the year to solidify my career goals concretely beyond, \"work with great people and make great things.\"\n\nI have a career in tech across corporations and startups of varying sizes. I know what kind of teams I want to work with and what kind of teams I want to avoid. For a while, these were the biggest career problems I faced.\n\nAfter a few proving years, having a well-paying job as a programmer in tech felt like a given. Privileged, I know. I could feel my personal drive start to slip and the temptation of complacency encroaching upon me.\n\nNow I sit on Zoom calls for part of the week, interviewing similarly-skilled and competent people. Many of them were laid off from their jobs, with one key difference between their economic uncertainty and my own situation.\n\nI work for a different company than them, one less impacted by the global pandemic.\n\n---\n\n# Be Organized\n\nCOVID-19 has ravaged everyone's plans. In the worst cases, it's taken lives and economic security. In these times of uncertainty, leaders remain important examples for their teams. Beyond giving a damn and providing assurances, we serve as guides for teams navigating confusion and anxiety.\n\nNow, more than at any other time, it's important to be organized in thought and action. This is not the time for chaos. People leaders need to provide a foundation for their team to succeed.\n\n> This is not the time for chaos.\n\nIn my case, this meant I had to ditch my outdated note-taking system of belching into a different markdown document each meeting. I would hope to find these notes when discussing esoteric project details again in a few months. *It was Sisyphean futility.*\n\nI pumped the brakes on my typical priorities for a few days in order to invest in migrating to another platform. **Notion is great, by the way.** This has allowed me to organize my thoughts and be better prepared for each meeting and random question that came my way.\n\nEvery modern manager needs to have a note-taking platform that has a smart searching feature not tied to file names. This is essential. Today, I only need to remember a key phrase or topic in order to find that footnote from an otherwise uneventful status meeting.\n\nAlong with taking better notes, I also started taking *more notes*. Where I had been more freewheeling with my announcements, I was now preparing statements and reviewing them to make sure I communicated with purpose.\n\nUnlike before where I was more apt to act upon feedback with immediacy, I have been more meticulous. I note feedback, the date it was given, and other context around it. This is to avoid making decisions in the heat of the moment. Where possible, leaving space for consideration leads to better decisions; something my team benefits from.\n\nA lot of us are working remotely for the first time. Whether we express it or not, we are anxious; sizing up own economic welfare and wondering how to work effectively. Our teams are feeling this too. We should first put good effort into organizing ourselves. People benefit from any structure that leaders can given them.\n\nHaving a disorganized leader is stressful. We must free our team of that stress.\n\n# Encourage Interaction\n\nAcknowledge\n\nBe available, 1:1s and in group settings, formal and informal\n\nBe human, link to an outside article for thought leadership\n\n# Overcommunicate\n\nCheck and double-check\n\nAsk for feedback, often and in various ways\n\nTalk about outlining priorities and providing a vision for the team\n\n---\n\n**A good leader is a shock absorber that cushions the blows of change.**\n\nI've gotten over the initial year hump of technical people management. The training wheels have come off! I'm finally past the point where I wonder if I'm suited for the job. It's mine now and I have people depending on me to be good at it.",
  "bodyHtml": "<p><img src=\"hero.jpg\" alt=\"wide: View from Hope Outdoor Gallery in Austin, TX. © 2020 John Apostol\"></p>\n<h1>Personal Context</h1>\n<p>I had planned for 2020 to be the most important year in my career. This was the year to solidify my career goals concretely beyond, &quot;work with great people and make great things.&quot;</p>\n<p>I have a career in tech across corporations and startups of varying sizes. I know what kind of teams I want to work with and what kind of teams I want to avoid. For a while, these were the biggest career problems I faced.</p>\n<p>After a few proving years, having a well-paying job as a programmer in tech felt like a given. Privileged, I know. I could feel my personal drive start to slip and the temptation of complacency encroaching upon me.</p>\n<p>Now I sit on Zoom calls for part of the week, interviewing similarly-skilled and competent people. Many of them were laid off from their jobs, with one key difference between their economic uncertainty and my own situation.</p>\n<p>I work for a different company than them, one less impacted by the global pandemic.</p>\n<hr>\n<h1>Be Organized</h1>\n<p>COVID-19 has ravaged everyone's plans. In the worst cases, it's taken lives and economic security. In these times of uncertainty, leaders remain important examples for their teams. Beyond giving a damn and providing assurances, we serve as guides for teams navigating confusion and anxiety.</p>\n<p>Now, more than at any other time, it's important to be organized in thought and action. This is not the time for chaos. People leaders need to provide a foundation for their team to succeed.</p>\n<blockquote>\n<p>This is not the time for chaos.</p>\n</blockquote>\n<p>In my case, this meant I had to ditch my outdated note-taking system of belching into a different markdown document each meeting. I would hope to find these notes when discussing esoteric project details again in a few months. <em>It was Sisyphean futility.</em></p>\n<p>I pumped the brakes on my typical priorities for a few days in order to invest in migrating to another platform. <strong>Notion is great, by the way.</strong> This has allowed me to organize my thoughts and be better prepared for each meeting and random question that came my way.</p>\n<p>Every modern manager needs to have a note-taking platform that has a smart searching feature not tied to file names. This is essential. Today, I only need to remember a key phrase or topic in order to find that footnote from an otherwise uneventful status meeting.</p>\n<p>Along with taking better notes, I also started taking <em>more notes</em>. Where I had been more freewheeling with my announcements, I was now preparing statements and reviewing them to make sure I communicated with purpose.</p>\n<p>Unlike before where I was more apt to act upon feedback with immediacy, I have been more meticulous. I note feedback, the date it was given, and other context around it. This is to avoid making decisions in the heat of the moment. Where possible, leaving space for consideration leads to better decisions; something my team benefits from.</p>\n<p>A lot of us are working remotely for the first time. Whether we express it or not, we are anxious; sizing up own economic welfare and wondering how to work effectively. Our teams are feeling this too. We should first put good effort into organizing ourselves. People benefit from any structure that leaders can given them.</p>\n<p>Having a disorganized leader is stressful. We must free our team of that stress.</p>\n<h1>Encourage Interaction</h1>\n<p>Acknowledge</p>\n<p>Be available, 1:1s and in group settings, formal and informal</p>\n<p>Be human, link to an outside article for thought leadership</p>\n<h1>Overcommunicate</h1>\n<p>Check and double-check</p>\n<p>Ask for feedback, often and in various ways</p>\n<p>Talk about outlining priorities and providing a vision for the team</p>\n<hr>\n<p><strong>A good leader is a shock absorber that cushions the blows of change.</strong></p>\n<p>I've gotten over the initial year hump of technical people management. The training wheels have come off! I'm finally past the point where I wonder if I'm suited for the job. It's mine now and I have people depending on me to be good at it.</p>\n",
  "dir": "content",
  "base": "2020-04-28.json",
  "ext": ".json",
  "sourceBase": "2020-04-28.md",
  "sourceExt": ".md"
}